Cosaldi/buddy-idf/sdkconfig.defaults
# ─────────────────────────────────────────────
#  DeskBuddy — sdkconfig.defaults
#  Target: ESP32-C3 Super Mini
# ─────────────────────────────────────────────

# ── Target ───────────────────────────────────
CONFIG_IDF_TARGET="esp32"

# ── Flash ────────────────────────────────────
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y

# ── Partition table ──────────────────────────
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000

# ── FreeRTOS ─────────────────────────────────
CONFIG_FREERTOS_HZ=1000
# CONFIG_FREERTOS_UNICORE — ESP32 DevKit is dual-core, leave unset

# ── Main task stack ──────────────────────────
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# ── WiFi ─────────────────────────────────────
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=4
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=8
CONFIG_ESP_WIFI_TX_BUFFER_TYPE_DYNAMIC=y
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=y

# ── LwIP / SNTP (NTP) ────────────────────────
CONFIG_LWIP_SNTP_UPDATE_DELAY=3600000   # re-sync every hour (ms)
CONFIG_LWIP_SNTP_MAX_SERVERS=2

# ── I2C (for SSD1306) ────────────────────────
CONFIG_SOC_I2C_NUM=1

# ── esp_lcd ──────────────────────────────────
CONFIG_LCD_PANEL_IO_FORMAT_BUF_SIZE=32

# ── LVGL (esp_lvgl_port picks these up) ──────
CONFIG_LV_MEM_SIZE_KILOBYTES=48
CONFIG_LV_ATTRIBUTE_FAST_MEM_USE_IRAM=y

# ────── LVGL built-in fonts ──────────────────
CONFIG_LV_FONT_MONTSERRAT_10=y
# CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_14=y

# ────── Optional default font ──────────────────
CONFIG_LV_FONT_DEFAULT_MONTSERRAT_14=y

# ── Logging ──────────────────────────────────
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y

# ── Bootloader ───────────────────────────────
CONFIG_BOOTLOADER_LOG_LEVEL_WARN=y

# ── Power / light sleep (optional, safe to keep) ─
CONFIG_PM_ENABLE=n
